import './focus_anime.css'


//========================================================================
// コンポーネント
//========================================================================
// 【プロパティ】
//    none
// 
//========================================================================
function Focus_anime() {
    
    //------------------------------------------------
    // レンダリング
    //------------------------------------------------
    return(
        <div className='focus_anime'>
            <div></div>
            <div></div>
            <div></div>
            <div></div>
            <div></div>
            <div></div>
            <span></span>
            <span></span>
            <span></span>
        </div>
    )
}

export default Focus_anime