import './flower_anime.css'


//========================================================================
// コンポーネント
//========================================================================
// 【プロパティ】
//    none
// 
//========================================================================
function Flower_anime() {
    
    //------------------------------------------------
    // レンダリング
    //------------------------------------------------
    return(
        <div className="flower_anime">
            <div style={{'--val': 0}}></div>
            <div style={{'--val': 1}}></div>
            <div style={{'--val': 2}}></div>
            <div style={{'--val': 3}}></div>
            <div style={{'--val': 4}}></div>
            <div style={{'--val': 5}}></div>
            <div style={{'--val': 6}}></div>
            <div style={{'--val': 7}}></div>
        </div>
    )
}

export default Flower_anime