import './simple_button.css'


//========================================================================
// コンポーネント
//========================================================================
// 【プロパティ】
//    props.label : ボタンに表示される文字
//
// 
//========================================================================
function Simple_button(props) {

    //------------------------------------------------
    // クリックイベント
    //------------------------------------------------
    function click_event(){
        // 好きな処理を記載
        alert('ボタンが押されました。');
    }


    //------------------------------------------------
    // レンダリング
    //------------------------------------------------
    return(
        <button className='simple_button'
            onClick={click_event}>
                {props.label ? props.label : 'Button'}
        </button>
    )
}

export default Simple_button