import { nanoid } from "nanoid";
import './text_input.css'



//========================================================================
// コンポーネント
//========================================================================
// 【プロパティ】
//    props.id : インプットのid
// 
//========================================================================
function Text_input(props) {
    // インプットのID
    const input_id = props.id ? props.id : nanoid();

    //------------------------------------------------
    // 変更イベント
    //------------------------------------------------
    function change_event(){
        // 好きな処理を記載
        
    }


    //------------------------------------------------
    // レンダリング
    //------------------------------------------------
    return(
        <input type='text' className='text_input' id={input_id} 
            onChange={change_event}/>
    )
}

export default Text_input